YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/b_mcal_nxp_S32K3xx/b_mcal_Base_nxp_S32K3xx/header/S32M27x_AEC_AE.h
#define AEC_AE_EVENTS_STATUS_TEMP_WDG_PHY_FL_MASK (0x20U)
#define AEC_AE_EVENTS_STATUS_TEMP_WDG_PHY_FL_SHIFT (5U)
#define AEC_AE_EVENTS_STATUS_TEMP_WDG_PHY_FL_WIDTH (1U)
#define AEC_AE_EVENTS_STATUS_TEMP_WDG_PHY_FL(x)  (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_STATUS_TEMP_WDG_PHY_FL_SHIFT)) & AEC_AE_EVENTS_STATUS_TEMP_WDG_PHY_FL_MASK)

#define AEC_AE_EVENTS_STATUS_CAN_INT_FL_MASK     (0x40U)
#define AEC_AE_EVENTS_STATUS_CAN_INT_FL_SHIFT    (6U)
#define AEC_AE_EVENTS_STATUS_CAN_INT_FL_WIDTH    (1U)
#define AEC_AE_EVENTS_STATUS_CAN_INT_FL(x)       (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_STATUS_CAN_INT_FL_SHIFT)) & AEC_AE_EVENTS_STATUS_CAN_INT_FL_MASK)

#define AEC_AE_EVENTS_STATUS_LVD_VDDC_FL_MASK    (0x80U)
#define AEC_AE_EVENTS_STATUS_LVD_VDDC_FL_SHIFT   (7U)
#define AEC_AE_EVENTS_STATUS_LVD_VDDC_FL_WIDTH   (1U)
#define AEC_AE_EVENTS_STATUS_LVD_VDDC_FL(x)      (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_STATUS_LVD_VDDC_FL_SHIFT)) & AEC_AE_EVENTS_STATUS_LVD_VDDC_FL_MASK)

#define AEC_AE_EVENTS_STATUS_WAKEUP_FL_MASK      (0x100U)
#define AEC_AE_EVENTS_STATUS_WAKEUP_FL_SHIFT     (8U)
#define AEC_AE_EVENTS_STATUS_WAKEUP_FL_WIDTH     (1U)
#define AEC_AE_EVENTS_STATUS_WAKEUP_FL(x)        (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_STATUS_WAKEUP_FL_SHIFT)) & AEC_AE_EVENTS_STATUS_WAKEUP_FL_MASK)

#define AEC_AE_EVENTS_STATUS_HVI_ACTIVE_FL_MASK  (0x200U)
#define AEC_AE_EVENTS_STATUS_HVI_ACTIVE_FL_SHIFT (9U)
#define AEC_AE_EVENTS_STATUS_HVI_ACTIVE_FL_WIDTH (1U)
#define AEC_AE_EVENTS_STATUS_HVI_ACTIVE_FL(x)    (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_STATUS_HVI_ACTIVE_FL_SHIFT)) & AEC_AE_EVENTS_STATUS_HVI_ACTIVE_FL_MASK)

#define AEC_AE_EVENTS_STATUS_HVI_AE_SUPPLY_FL_MASK (0x1000U)
#define AEC_AE_EVENTS_STATUS_HVI_AE_SUPPLY_FL_SHIFT (12U)
#define AEC_AE_EVENTS_STATUS_HVI_AE_SUPPLY_FL_WIDTH (1U)
#define AEC_AE_EVENTS_STATUS_HVI_AE_SUPPLY_FL(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_STATUS_HVI_AE_SUPPLY_FL_SHIFT)) & AEC_AE_EVENTS_STATUS_HVI_AE_SUPPLY_FL_MASK)

#define AEC_AE_EVENTS_STATUS_STATERESET_FL_MASK  (0x4000U)
#define AEC_AE_EVENTS_STATUS_STATERESET_FL_SHIFT (14U)
#define AEC_AE_EVENTS_STATUS_STATERESET_FL_WIDTH (1U)
#define AEC_AE_EVENTS_STATUS_STATERESET_FL(x)    (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_STATUS_STATERESET_FL_SHIFT)) & AEC_AE_EVENTS_STATUS_STATERESET_FL_MASK)

#define AEC_AE_EVENTS_STATUS_FRAMEWIDTH_FL_MASK  (0x8000U)
#define AEC_AE_EVENTS_STATUS_FRAMEWIDTH_FL_SHIFT (15U)
#define AEC_AE_EVENTS_STATUS_FRAMEWIDTH_FL_WIDTH (1U)
#define AEC_AE_EVENTS_STATUS_FRAMEWIDTH_FL(x)    (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_STATUS_FRAMEWIDTH_FL_SHIFT)) & AEC_AE_EVENTS_STATUS_FRAMEWIDTH_FL_MASK)
/*! @} */

/*! @name EVENTS_ENABLE - Event Notifications Enable */
/*! @{ */

#define AEC_AE_EVENTS_ENABLE_LIN_INT_EN_MASK     (0x4U)
#define AEC_AE_EVENTS_ENABLE_LIN_INT_EN_SHIFT    (2U)
#define AEC_AE_EVENTS_ENABLE_LIN_INT_EN_WIDTH    (1U)
#define AEC_AE_EVENTS_ENABLE_LIN_INT_EN(x)       (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_ENABLE_LIN_INT_EN_SHIFT)) & AEC_AE_EVENTS_ENABLE_LIN_INT_EN_MASK)

#define AEC_AE_EVENTS_ENABLE_OCD_VDDE_EN_MASK    (0x8U)
#define AEC_AE_EVENTS_ENABLE_OCD_VDDE_EN_SHIFT   (3U)
#define AEC_AE_EVENTS_ENABLE_OCD_VDDE_EN_WIDTH   (1U)
#define AEC_AE_EVENTS_ENABLE_OCD_VDDE_EN(x)      (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_ENABLE_OCD_VDDE_EN_SHIFT)) & AEC_AE_EVENTS_ENABLE_OCD_VDDE_EN_MASK)

#define AEC_AE_EVENTS_ENABLE_TEMP_WDG_PMC_EN_MASK (0x10U)
#define AEC_AE_EVENTS_ENABLE_TEMP_WDG_PMC_EN_SHIFT (4U)
#define AEC_AE_EVENTS_ENABLE_TEMP_WDG_PMC_EN_WIDTH (1U)
#define AEC_AE_EVENTS_ENABLE_TEMP_WDG_PMC_EN(x)  (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_ENABLE_TEMP_WDG_PMC_EN_SHIFT)) & AEC_AE_EVENTS_ENABLE_TEMP_WDG_PMC_EN_MASK)

#define AEC_AE_EVENTS_ENABLE_TEMP_WDG_PHY_EN_MASK (0x20U)
#define AEC_AE_EVENTS_ENABLE_TEMP_WDG_PHY_EN_SHIFT (5U)
#define AEC_AE_EVENTS_ENABLE_TEMP_WDG_PHY_EN_WIDTH (1U)
#define AEC_AE_EVENTS_ENABLE_TEMP_WDG_PHY_EN(x)  (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_ENABLE_TEMP_WDG_PHY_EN_SHIFT)) & AEC_AE_EVENTS_ENABLE_TEMP_WDG_PHY_EN_MASK)

#define AEC_AE_EVENTS_ENABLE_CAN_INT_EN_MASK     (0x40U)
#define AEC_AE_EVENTS_ENABLE_CAN_INT_EN_SHIFT    (6U)
#define AEC_AE_EVENTS_ENABLE_CAN_INT_EN_WIDTH    (1U)
#define AEC_AE_EVENTS_ENABLE_CAN_INT_EN(x)       (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_ENABLE_CAN_INT_EN_SHIFT)) & AEC_AE_EVENTS_ENABLE_CAN_INT_EN_MASK)

#define AEC_AE_EVENTS_ENABLE_LVD_VDDC_EN_MASK    (0x80U)
#define AEC_AE_EVENTS_ENABLE_LVD_VDDC_EN_SHIFT   (7U)
#define AEC_AE_EVENTS_ENABLE_LVD_VDDC_EN_WIDTH   (1U)
#define AEC_AE_EVENTS_ENABLE_LVD_VDDC_EN(x)      (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_ENABLE_LVD_VDDC_EN_SHIFT)) & AEC_AE_EVENTS_ENABLE_LVD_VDDC_EN_MASK)

#define AEC_AE_EVENTS_ENABLE_WAKEUP_EN_MASK      (0x100U)
#define AEC_AE_EVENTS_ENABLE_WAKEUP_EN_SHIFT     (8U)
#define AEC_AE_EVENTS_ENABLE_WAKEUP_EN_WIDTH     (1U)
#define AEC_AE_EVENTS_ENABLE_WAKEUP_EN(x)        (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_ENABLE_WAKEUP_EN_SHIFT)) & AEC_AE_EVENTS_ENABLE_WAKEUP_EN_MASK)

#define AEC_AE_EVENTS_ENABLE_HVI_ACTIVE_EN_MASK  (0x200U)
#define AEC_AE_EVENTS_ENABLE_HVI_ACTIVE_EN_SHIFT (9U)
#define AEC_AE_EVENTS_ENABLE_HVI_ACTIVE_EN_WIDTH (1U)
#define AEC_AE_EVENTS_ENABLE_HVI_ACTIVE_EN(x)    (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_ENABLE_HVI_ACTIVE_EN_SHIFT)) & AEC_AE_EVENTS_ENABLE_HVI_ACTIVE_EN_MASK)

#define AEC_AE_EVENTS_ENABLE_HVI_AE_SUPPLY_EN_MASK (0x1000U)
#define AEC_AE_EVENTS_ENABLE_HVI_AE_SUPPLY_EN_SHIFT (12U)
#define AEC_AE_EVENTS_ENABLE_HVI_AE_SUPPLY_EN_WIDTH (1U)
#define AEC_AE_EVENTS_ENABLE_HVI_AE_SUPPLY_EN(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_ENABLE_HVI_AE_SUPPLY_EN_SHIFT)) & AEC_AE_EVENTS_ENABLE_HVI_AE_SUPPLY_EN_MASK)

#define AEC_AE_EVENTS_ENABLE_STATERESET_EN_MASK  (0x4000U)
#define AEC_AE_EVENTS_ENABLE_STATERESET_EN_SHIFT (14U)
#define AEC_AE_EVENTS_ENABLE_STATERESET_EN_WIDTH (1U)
#define AEC_AE_EVENTS_ENABLE_STATERESET_EN(x)    (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_ENABLE_STATERESET_EN_SHIFT)) & AEC_AE_EVENTS_ENABLE_STATERESET_EN_MASK)

