YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/b_mcal_nxp_S32K3xx/b_mcal_Base_nxp_S32K3xx/header/S32M27x_AEC_AE.h
#define AEC_AE_IRQ_SET_FLT03_SET_MASK            (0x80000U)
#define AEC_AE_IRQ_SET_FLT03_SET_SHIFT           (19U)
#define AEC_AE_IRQ_SET_FLT03_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT03_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT03_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT03_SET_MASK)

#define AEC_AE_IRQ_SET_FLT04_SET_MASK            (0x100000U)
#define AEC_AE_IRQ_SET_FLT04_SET_SHIFT           (20U)
#define AEC_AE_IRQ_SET_FLT04_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT04_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT04_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT04_SET_MASK)

#define AEC_AE_IRQ_SET_FLT07_SET_MASK            (0x800000U)
#define AEC_AE_IRQ_SET_FLT07_SET_SHIFT           (23U)
#define AEC_AE_IRQ_SET_FLT07_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT07_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT07_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT07_SET_MASK)

#define AEC_AE_IRQ_SET_FLT08_SET_MASK            (0x1000000U)
#define AEC_AE_IRQ_SET_FLT08_SET_SHIFT           (24U)
#define AEC_AE_IRQ_SET_FLT08_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT08_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT08_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT08_SET_MASK)

#define AEC_AE_IRQ_SET_FLT09_SET_MASK            (0x2000000U)
#define AEC_AE_IRQ_SET_FLT09_SET_SHIFT           (25U)
#define AEC_AE_IRQ_SET_FLT09_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT09_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT09_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT09_SET_MASK)

#define AEC_AE_IRQ_SET_FLT10_SET_MASK            (0x4000000U)
#define AEC_AE_IRQ_SET_FLT10_SET_SHIFT           (26U)
#define AEC_AE_IRQ_SET_FLT10_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT10_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT10_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT10_SET_MASK)

#define AEC_AE_IRQ_SET_FLT11_SET_MASK            (0x8000000U)
#define AEC_AE_IRQ_SET_FLT11_SET_SHIFT           (27U)
#define AEC_AE_IRQ_SET_FLT11_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT11_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT11_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT11_SET_MASK)

#define AEC_AE_IRQ_SET_FLT12_SET_MASK            (0x10000000U)
#define AEC_AE_IRQ_SET_FLT12_SET_SHIFT           (28U)
#define AEC_AE_IRQ_SET_FLT12_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT12_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT12_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT12_SET_MASK)

#define AEC_AE_IRQ_SET_FLT13_SET_MASK            (0x20000000U)
#define AEC_AE_IRQ_SET_FLT13_SET_SHIFT           (29U)
#define AEC_AE_IRQ_SET_FLT13_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT13_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT13_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT13_SET_MASK)

#define AEC_AE_IRQ_SET_FLT14_SET_MASK            (0x40000000U)
#define AEC_AE_IRQ_SET_FLT14_SET_SHIFT           (30U)
#define AEC_AE_IRQ_SET_FLT14_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT14_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT14_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT14_SET_MASK)

#define AEC_AE_IRQ_SET_FLT15_SET_MASK            (0x80000000U)
#define AEC_AE_IRQ_SET_FLT15_SET_SHIFT           (31U)
#define AEC_AE_IRQ_SET_FLT15_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT15_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT15_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT15_SET_MASK)
/*! @} */

/*! @name SAFETY_ENABLE - Safety Enable */
/*! @{ */

#define AEC_AE_SAFETY_ENABLE_EVENT00_EN_MASK     (0x1U)
#define AEC_AE_SAFETY_ENABLE_EVENT00_EN_SHIFT    (0U)
#define AEC_AE_SAFETY_ENABLE_EVENT00_EN_WIDTH    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT00_EN(x)       (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT00_EN_SHIFT)) & AEC_AE_SAFETY_ENABLE_EVENT00_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT01_EN_MASK     (0x2U)
#define AEC_AE_SAFETY_ENABLE_EVENT01_EN_SHIFT    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT01_EN_WIDTH    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT01_EN(x)       (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT01_EN_SHIFT)) & AEC_AE_SAFETY_ENABLE_EVENT01_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT02_EN_MASK     (0x4U)
#define AEC_AE_SAFETY_ENABLE_EVENT02_EN_SHIFT    (2U)
#define AEC_AE_SAFETY_ENABLE_EVENT02_EN_WIDTH    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT02_EN(x)       (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT02_EN_SHIFT)) & AEC_AE_SAFETY_ENABLE_EVENT02_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT03_EN_MASK     (0x8U)
#define AEC_AE_SAFETY_ENABLE_EVENT03_EN_SHIFT    (3U)
#define AEC_AE_SAFETY_ENABLE_EVENT03_EN_WIDTH    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT03_EN(x)       (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT03_EN_SHIFT)) & AEC_AE_SAFETY_ENABLE_EVENT03_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT04_EN_MASK     (0x10U)
#define AEC_AE_SAFETY_ENABLE_EVENT04_EN_SHIFT    (4U)
#define AEC_AE_SAFETY_ENABLE_EVENT04_EN_WIDTH    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT04_EN(x)       (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT04_EN_SHIFT)) & AEC_AE_SAFETY_ENABLE_EVENT04_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT05_EN_MASK     (0x20U)
#define AEC_AE_SAFETY_ENABLE_EVENT05_EN_SHIFT    (5U)
#define AEC_AE_SAFETY_ENABLE_EVENT05_EN_WIDTH    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT05_EN(x)       (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT05_EN_SHIFT)) & AEC_AE_SAFETY_ENABLE_EVENT05_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT06_EN_MASK     (0x40U)
#define AEC_AE_SAFETY_ENABLE_EVENT06_EN_SHIFT    (6U)
#define AEC_AE_SAFETY_ENABLE_EVENT06_EN_WIDTH    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT06_EN(x)       (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT06_EN_SHIFT)) & AEC_AE_SAFETY_ENABLE_EVENT06_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT07_EN_MASK     (0x80U)
#define AEC_AE_SAFETY_ENABLE_EVENT07_EN_SHIFT    (7U)
#define AEC_AE_SAFETY_ENABLE_EVENT07_EN_WIDTH    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT07_EN(x)       (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT07_EN_SHIFT)) & AEC_AE_SAFETY_ENABLE_EVENT07_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT08_EN_MASK     (0x100U)
#define AEC_AE_SAFETY_ENABLE_EVENT08_EN_SHIFT    (8U)
#define AEC_AE_SAFETY_ENABLE_EVENT08_EN_WIDTH    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT08_EN(x)       (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT08_EN_SHIFT)) & AEC_AE_SAFETY_ENABLE_EVENT08_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT09_EN_MASK     (0x200U)
#define AEC_AE_SAFETY_ENABLE_EVENT09_EN_SHIFT    (9U)
#define AEC_AE_SAFETY_ENABLE_EVENT09_EN_WIDTH    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT09_EN(x)       (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT09_EN_SHIFT)) & AEC_AE_SAFETY_ENABLE_EVENT09_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT10_EN_MASK     (0x400U)
#define AEC_AE_SAFETY_ENABLE_EVENT10_EN_SHIFT    (10U)
#define AEC_AE_SAFETY_ENABLE_EVENT10_EN_WIDTH    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT10_EN(x)       (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT10_EN_SHIFT)) & AEC_AE_SAFETY_ENABLE_EVENT10_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT11_EN_MASK     (0x800U)
#define AEC_AE_SAFETY_ENABLE_EVENT11_EN_SHIFT    (11U)
#define AEC_AE_SAFETY_ENABLE_EVENT11_EN_WIDTH    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT11_EN(x)       (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT11_EN_SHIFT)) & AEC_AE_SAFETY_ENABLE_EVENT11_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT12_EN_MASK     (0x1000U)
#define AEC_AE_SAFETY_ENABLE_EVENT12_EN_SHIFT    (12U)
#define AEC_AE_SAFETY_ENABLE_EVENT12_EN_WIDTH    (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT12_EN(x)       (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT12_EN_SHIFT)) & AEC_AE_SAFETY_ENABLE_EVENT12_EN_MASK)

