YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/b_mcal_nxp_S32K3xx/b_mcal_Base_nxp_S32K3xx/header/S32M27x_AEC_AE.h
/*! @name ALIVE_WD_CFG - Alive Watchdog Configuration */
/*! @{ */

#define AEC_AE_ALIVE_WD_CFG_WDW_PERIOD_MASK      (0xFU)
#define AEC_AE_ALIVE_WD_CFG_WDW_PERIOD_SHIFT     (0U)
#define AEC_AE_ALIVE_WD_CFG_WDW_PERIOD_WIDTH     (4U)
#define AEC_AE_ALIVE_WD_CFG_WDW_PERIOD(x)        (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_CFG_WDW_PERIOD_SHIFT)) & AEC_AE_ALIVE_WD_CFG_WDW_PERIOD_MASK)

#define AEC_AE_ALIVE_WD_CFG_WDW_DC_MASK          (0xC0U)
#define AEC_AE_ALIVE_WD_CFG_WDW_DC_SHIFT         (6U)
#define AEC_AE_ALIVE_WD_CFG_WDW_DC_WIDTH         (2U)
#define AEC_AE_ALIVE_WD_CFG_WDW_DC(x)            (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_CFG_WDW_DC_SHIFT)) & AEC_AE_ALIVE_WD_CFG_WDW_DC_MASK)

#define AEC_AE_ALIVE_WD_CFG_WDW_BADRESP_MASK     (0x300U)
#define AEC_AE_ALIVE_WD_CFG_WDW_BADRESP_SHIFT    (8U)
#define AEC_AE_ALIVE_WD_CFG_WDW_BADRESP_WIDTH    (2U)
#define AEC_AE_ALIVE_WD_CFG_WDW_BADRESP(x)       (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_CFG_WDW_BADRESP_SHIFT)) & AEC_AE_ALIVE_WD_CFG_WDW_BADRESP_MASK)

#define AEC_AE_ALIVE_WD_CFG_WDW_MODE_MASK        (0x4000U)
#define AEC_AE_ALIVE_WD_CFG_WDW_MODE_SHIFT       (14U)
#define AEC_AE_ALIVE_WD_CFG_WDW_MODE_WIDTH       (1U)
#define AEC_AE_ALIVE_WD_CFG_WDW_MODE(x)          (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_CFG_WDW_MODE_SHIFT)) & AEC_AE_ALIVE_WD_CFG_WDW_MODE_MASK)

#define AEC_AE_ALIVE_WD_CFG_WDW_FAULTREC_MASK    (0x8000U)
#define AEC_AE_ALIVE_WD_CFG_WDW_FAULTREC_SHIFT   (15U)
#define AEC_AE_ALIVE_WD_CFG_WDW_FAULTREC_WIDTH   (1U)
#define AEC_AE_ALIVE_WD_CFG_WDW_FAULTREC(x)      (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_CFG_WDW_FAULTREC_SHIFT)) & AEC_AE_ALIVE_WD_CFG_WDW_FAULTREC_MASK)
/*! @} */

/*! @name ALIVE_WD_TOKEN - Alive Watchdog Reference Value */
/*! @{ */

#define AEC_AE_ALIVE_WD_TOKEN_WD_TOKEN_MASK      (0xFFFFU)
#define AEC_AE_ALIVE_WD_TOKEN_WD_TOKEN_SHIFT     (0U)
#define AEC_AE_ALIVE_WD_TOKEN_WD_TOKEN_WIDTH     (16U)
#define AEC_AE_ALIVE_WD_TOKEN_WD_TOKEN(x)        (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_TOKEN_WD_TOKEN_SHIFT)) & AEC_AE_ALIVE_WD_TOKEN_WD_TOKEN_MASK)
/*! @} */

/*! @name ALIVE_WD_ANSWER - Alive Watchdog Answer */
/*! @{ */

#define AEC_AE_ALIVE_WD_ANSWER_WD_ANSWER_MASK    (0xFFFFU)
#define AEC_AE_ALIVE_WD_ANSWER_WD_ANSWER_SHIFT   (0U)
#define AEC_AE_ALIVE_WD_ANSWER_WD_ANSWER_WIDTH   (16U)
#define AEC_AE_ALIVE_WD_ANSWER_WD_ANSWER(x)      (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_ANSWER_WD_ANSWER_SHIFT)) & AEC_AE_ALIVE_WD_ANSWER_WD_ANSWER_MASK)
/*! @} */

/*! @name FAULT_WD_CFG - Fault Watchdog Configuration */
/*! @{ */

#define AEC_AE_FAULT_WD_CFG_TIME_OUT_CFG_MASK    (0xFFFU)
#define AEC_AE_FAULT_WD_CFG_TIME_OUT_CFG_SHIFT   (0U)
#define AEC_AE_FAULT_WD_CFG_TIME_OUT_CFG_WIDTH   (12U)
#define AEC_AE_FAULT_WD_CFG_TIME_OUT_CFG(x)      (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULT_WD_CFG_TIME_OUT_CFG_SHIFT)) & AEC_AE_FAULT_WD_CFG_TIME_OUT_CFG_MASK)
/*! @} */

/*! @name CLKGEN_CFG - Clock Generator Configuration */
/*! @{ */

#define AEC_AE_CLKGEN_CFG_CLKGEN_CFG_MASK        (0x1FFU)
#define AEC_AE_CLKGEN_CFG_CLKGEN_CFG_SHIFT       (0U)
#define AEC_AE_CLKGEN_CFG_CLKGEN_CFG_WIDTH       (9U)
#define AEC_AE_CLKGEN_CFG_CLKGEN_CFG(x)          (((uint32_t)(((uint32_t)(x)) << AEC_AE_CLKGEN_CFG_CLKGEN_CFG_SHIFT)) & AEC_AE_CLKGEN_CFG_CLKGEN_CFG_MASK)

#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_VAL_MASK   (0x1FF0000U)
#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_VAL_SHIFT  (16U)
#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_VAL_WIDTH  (9U)
#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_VAL(x)     (((uint32_t)(((uint32_t)(x)) << AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_VAL_SHIFT)) & AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_VAL_MASK)

#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_CFG_MASK   (0x10000000U)
#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_CFG_SHIFT  (28U)
#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_CFG_WIDTH  (1U)
#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_CFG(x)     (((uint32_t)(((uint32_t)(x)) << AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_CFG_SHIFT)) & AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_CFG_MASK)
/*! @} */

/*! @name RSTGEN_CFG - Reset Generator Configuration */
/*! @{ */

#define AEC_AE_RSTGEN_CFG_RSTGEN_CFG_MASK        (0x1FFU)
#define AEC_AE_RSTGEN_CFG_RSTGEN_CFG_SHIFT       (0U)
#define AEC_AE_RSTGEN_CFG_RSTGEN_CFG_WIDTH       (9U)
#define AEC_AE_RSTGEN_CFG_RSTGEN_CFG(x)          (((uint16_t)(((uint16_t)(x)) << AEC_AE_RSTGEN_CFG_RSTGEN_CFG_SHIFT)) & AEC_AE_RSTGEN_CFG_RSTGEN_CFG_MASK)

#define AEC_AE_RSTGEN_CFG_NOFLUSH_MASK           (0x8000U)
#define AEC_AE_RSTGEN_CFG_NOFLUSH_SHIFT          (15U)
#define AEC_AE_RSTGEN_CFG_NOFLUSH_WIDTH          (1U)
#define AEC_AE_RSTGEN_CFG_NOFLUSH(x)             (((uint16_t)(((uint16_t)(x)) << AEC_AE_RSTGEN_CFG_NOFLUSH_SHIFT)) & AEC_AE_RSTGEN_CFG_NOFLUSH_MASK)
/*! @} */

/*! @name IO_FUNCMUX_CFG - IO Funcmux Configuration */
/*! @{ */

#define AEC_AE_IO_FUNCMUX_CFG_DPGA_OUT_MASK      (0x1U)
#define AEC_AE_IO_FUNCMUX_CFG_DPGA_OUT_SHIFT     (0U)
#define AEC_AE_IO_FUNCMUX_CFG_DPGA_OUT_WIDTH     (1U)
#define AEC_AE_IO_FUNCMUX_CFG_DPGA_OUT(x)        (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_DPGA_OUT_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_DPGA_OUT_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_AMPOUT_SEL_MASK    (0xEU)
#define AEC_AE_IO_FUNCMUX_CFG_AMPOUT_SEL_SHIFT   (1U)
#define AEC_AE_IO_FUNCMUX_CFG_AMPOUT_SEL_WIDTH   (3U)
#define AEC_AE_IO_FUNCMUX_CFG_AMPOUT_SEL(x)      (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_AMPOUT_SEL_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_AMPOUT_SEL_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_VDDE_DRV_MASK      (0x100U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_DRV_SHIFT     (8U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_DRV_WIDTH     (1U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_DRV(x)        (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_VDDE_DRV_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_VDDE_DRV_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_MASK      (0x200U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_SHIFT     (9U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_WIDTH     (1U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL(x)        (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_MASK       (0xC00U)
#define AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_SHIFT      (10U)
#define AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_WIDTH      (2U)
#define AEC_AE_IO_FUNCMUX_CFG_PHY_SEL(x)         (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_MASK   (0x1000U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_SHIFT  (12U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_WIDTH  (1U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN(x)     (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_D2D_EN_MASK        (0x10000U)
#define AEC_AE_IO_FUNCMUX_CFG_D2D_EN_SHIFT       (16U)
#define AEC_AE_IO_FUNCMUX_CFG_D2D_EN_WIDTH       (1U)
#define AEC_AE_IO_FUNCMUX_CFG_D2D_EN(x)          (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_D2D_EN_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_D2D_EN_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_OUTSEL_MASK        (0x20000U)
#define AEC_AE_IO_FUNCMUX_CFG_OUTSEL_SHIFT       (17U)
#define AEC_AE_IO_FUNCMUX_CFG_OUTSEL_WIDTH       (1U)
#define AEC_AE_IO_FUNCMUX_CFG_OUTSEL(x)          (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_OUTSEL_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_OUTSEL_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_CLKSEL_MASK        (0xC0000U)
#define AEC_AE_IO_FUNCMUX_CFG_CLKSEL_SHIFT       (18U)
#define AEC_AE_IO_FUNCMUX_CFG_CLKSEL_WIDTH       (2U)
#define AEC_AE_IO_FUNCMUX_CFG_CLKSEL(x)          (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_CLKSEL_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_CLKSEL_MASK)
/*! @} */

/*! @name LINPHY_CFG - LINPHY Configuration */
/*! @{ */

#define AEC_AE_LINPHY_CFG_MODE_MASK              (0x3U)
#define AEC_AE_LINPHY_CFG_MODE_SHIFT             (0U)
#define AEC_AE_LINPHY_CFG_MODE_WIDTH             (2U)
#define AEC_AE_LINPHY_CFG_MODE(x)                (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_MODE_SHIFT)) & AEC_AE_LINPHY_CFG_MODE_MASK)

#define AEC_AE_LINPHY_CFG_ENAWUP_MASK            (0x4U)
#define AEC_AE_LINPHY_CFG_ENAWUP_SHIFT           (2U)
#define AEC_AE_LINPHY_CFG_ENAWUP_WIDTH           (1U)
#define AEC_AE_LINPHY_CFG_ENAWUP(x)              (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_ENAWUP_SHIFT)) & AEC_AE_LINPHY_CFG_ENAWUP_MASK)

#define AEC_AE_LINPHY_CFG_ENATXTO_MASK           (0x8U)
#define AEC_AE_LINPHY_CFG_ENATXTO_SHIFT          (3U)
#define AEC_AE_LINPHY_CFG_ENATXTO_WIDTH          (1U)
#define AEC_AE_LINPHY_CFG_ENATXTO(x)             (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_ENATXTO_SHIFT)) & AEC_AE_LINPHY_CFG_ENATXTO_MASK)

