YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/b_mcal_nxp_S32K3xx/b_mcal_Base_nxp_S32K3xx/header/S32M27x_AEC_AE.h
#define AEC_AE_CANPHY_CFG_CANPHY_ENABLE_MASK     (0x8000U)
#define AEC_AE_CANPHY_CFG_CANPHY_ENABLE_SHIFT    (15U)
#define AEC_AE_CANPHY_CFG_CANPHY_ENABLE_WIDTH    (1U)
#define AEC_AE_CANPHY_CFG_CANPHY_ENABLE(x)       (((uint16_t)(((uint16_t)(x)) << AEC_AE_CANPHY_CFG_CANPHY_ENABLE_SHIFT)) & AEC_AE_CANPHY_CFG_CANPHY_ENABLE_MASK)
/*! @} */

/*! @name CANPHY_MONITOR - CANPHY Monitor */
/*! @{ */

#define AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_FL_MASK (0x1U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_FL_SHIFT (0U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_FL_WIDTH (1U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_FL(x)  (((uint16_t)(((uint16_t)(x)) << AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_FL_SHIFT)) & AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_FL_MASK)

#define AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_FL_MASK (0x2U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_FL_SHIFT (1U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_FL_WIDTH (1U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_FL(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_FL_SHIFT)) & AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_FL_MASK)

#define AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_FL_MASK (0x4U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_FL_SHIFT (2U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_FL_WIDTH (1U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_FL(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_FL_SHIFT)) & AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_FL_MASK)

#define AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_MON_MASK (0x10U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_MON_SHIFT (4U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_MON_WIDTH (1U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_MON(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_MON_SHIFT)) & AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_MON_MASK)

#define AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_MON_MASK (0x20U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_MON_SHIFT (5U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_MON_WIDTH (1U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_MON(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_MON_SHIFT)) & AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_MON_MASK)

#define AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_MON_MASK (0x40U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_MON_SHIFT (6U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_MON_WIDTH (1U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_MON(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_MON_SHIFT)) & AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_MON_MASK)

#define AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_EN_MASK (0x100U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_EN_SHIFT (8U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_EN_WIDTH (1U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_EN(x)  (((uint16_t)(((uint16_t)(x)) << AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_EN_SHIFT)) & AEC_AE_CANPHY_MONITOR_CANPHY_WKUP_EN_MASK)

#define AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_EN_MASK (0x200U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_EN_SHIFT (9U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_EN_WIDTH (1U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_EN(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_EN_SHIFT)) & AEC_AE_CANPHY_MONITOR_CANPHY_TXDOMTIMEDOUT_EN_MASK)

#define AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_EN_MASK (0x400U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_EN_SHIFT (10U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_EN_WIDTH (1U)
#define AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_EN(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_EN_SHIFT)) & AEC_AE_CANPHY_MONITOR_CANPHY_INVALIDSTATE_EN_MASK)
/*! @} */

/*! @name TMON_PHY - Temperature Monitor PHY */
/*! @{ */

#define AEC_AE_TMON_PHY_PHY_85_FL_MASK           (0x1U)
#define AEC_AE_TMON_PHY_PHY_85_FL_SHIFT          (0U)
#define AEC_AE_TMON_PHY_PHY_85_FL_WIDTH          (1U)
#define AEC_AE_TMON_PHY_PHY_85_FL(x)             (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_85_FL_SHIFT)) & AEC_AE_TMON_PHY_PHY_85_FL_MASK)

#define AEC_AE_TMON_PHY_PHY_125_FL_MASK          (0x2U)
#define AEC_AE_TMON_PHY_PHY_125_FL_SHIFT         (1U)
#define AEC_AE_TMON_PHY_PHY_125_FL_WIDTH         (1U)
#define AEC_AE_TMON_PHY_PHY_125_FL(x)            (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_125_FL_SHIFT)) & AEC_AE_TMON_PHY_PHY_125_FL_MASK)

#define AEC_AE_TMON_PHY_PHY_150_FL_MASK          (0x4U)
#define AEC_AE_TMON_PHY_PHY_150_FL_SHIFT         (2U)
#define AEC_AE_TMON_PHY_PHY_150_FL_WIDTH         (1U)
#define AEC_AE_TMON_PHY_PHY_150_FL(x)            (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_150_FL_SHIFT)) & AEC_AE_TMON_PHY_PHY_150_FL_MASK)

#define AEC_AE_TMON_PHY_PHY_175_FL_MASK          (0x8U)
#define AEC_AE_TMON_PHY_PHY_175_FL_SHIFT         (3U)
#define AEC_AE_TMON_PHY_PHY_175_FL_WIDTH         (1U)
#define AEC_AE_TMON_PHY_PHY_175_FL(x)            (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_175_FL_SHIFT)) & AEC_AE_TMON_PHY_PHY_175_FL_MASK)

#define AEC_AE_TMON_PHY_PHY_85_MON_MASK          (0x100U)
#define AEC_AE_TMON_PHY_PHY_85_MON_SHIFT         (8U)
#define AEC_AE_TMON_PHY_PHY_85_MON_WIDTH         (1U)
#define AEC_AE_TMON_PHY_PHY_85_MON(x)            (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_85_MON_SHIFT)) & AEC_AE_TMON_PHY_PHY_85_MON_MASK)

#define AEC_AE_TMON_PHY_PHY_125_MON_MASK         (0x200U)
#define AEC_AE_TMON_PHY_PHY_125_MON_SHIFT        (9U)
#define AEC_AE_TMON_PHY_PHY_125_MON_WIDTH        (1U)
#define AEC_AE_TMON_PHY_PHY_125_MON(x)           (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_125_MON_SHIFT)) & AEC_AE_TMON_PHY_PHY_125_MON_MASK)

#define AEC_AE_TMON_PHY_PHY_150_MON_MASK         (0x400U)
#define AEC_AE_TMON_PHY_PHY_150_MON_SHIFT        (10U)
#define AEC_AE_TMON_PHY_PHY_150_MON_WIDTH        (1U)
#define AEC_AE_TMON_PHY_PHY_150_MON(x)           (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_150_MON_SHIFT)) & AEC_AE_TMON_PHY_PHY_150_MON_MASK)

#define AEC_AE_TMON_PHY_PHY_175_MON_MASK         (0x800U)
#define AEC_AE_TMON_PHY_PHY_175_MON_SHIFT        (11U)
#define AEC_AE_TMON_PHY_PHY_175_MON_WIDTH        (1U)
#define AEC_AE_TMON_PHY_PHY_175_MON(x)           (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_175_MON_SHIFT)) & AEC_AE_TMON_PHY_PHY_175_MON_MASK)

#define AEC_AE_TMON_PHY_PHY_85_EN_MASK           (0x10000U)
#define AEC_AE_TMON_PHY_PHY_85_EN_SHIFT          (16U)
#define AEC_AE_TMON_PHY_PHY_85_EN_WIDTH          (1U)
#define AEC_AE_TMON_PHY_PHY_85_EN(x)             (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_85_EN_SHIFT)) & AEC_AE_TMON_PHY_PHY_85_EN_MASK)

#define AEC_AE_TMON_PHY_PHY_125_EN_MASK          (0x20000U)
#define AEC_AE_TMON_PHY_PHY_125_EN_SHIFT         (17U)
#define AEC_AE_TMON_PHY_PHY_125_EN_WIDTH         (1U)
#define AEC_AE_TMON_PHY_PHY_125_EN(x)            (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_125_EN_SHIFT)) & AEC_AE_TMON_PHY_PHY_125_EN_MASK)

#define AEC_AE_TMON_PHY_PHY_150_EN_MASK          (0x40000U)
#define AEC_AE_TMON_PHY_PHY_150_EN_SHIFT         (18U)
#define AEC_AE_TMON_PHY_PHY_150_EN_WIDTH         (1U)
#define AEC_AE_TMON_PHY_PHY_150_EN(x)            (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_150_EN_SHIFT)) & AEC_AE_TMON_PHY_PHY_150_EN_MASK)

